perf-tests/results_new_20260420_151648/vertx/k6_ramp_accounts.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/k6_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 05/50 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/40.0s

running (0m02.0s), 10/50 VUs, 98 complete and 0 interrupted iterations
default   [   5% ] 10/50 VUs  02.0s/40.0s

running (0m03.0s), 15/50 VUs, 188 complete and 0 interrupted iterations
default   [   7% ] 15/50 VUs  03.0s/40.0s

running (0m04.0s), 20/50 VUs, 363 complete and 0 interrupted iterations
default   [  10% ] 20/50 VUs  04.0s/40.0s

running (0m05.0s), 25/50 VUs, 563 complete and 0 interrupted iterations
default   [  12% ] 25/50 VUs  05.0s/40.0s

running (0m06.0s), 30/50 VUs, 692 complete and 0 interrupted iterations
default   [  15% ] 30/50 VUs  06.0s/40.0s

running (0m07.0s), 35/50 VUs, 858 complete and 0 interrupted iterations
default   [  17% ] 35/50 VUs  07.0s/40.0s

running (0m08.0s), 40/50 VUs, 1200 complete and 0 interrupted iterations
default   [  20% ] 40/50 VUs  08.0s/40.0s

running (0m09.0s), 45/50 VUs, 1616 complete and 0 interrupted iterations
default   [  22% ] 45/50 VUs  09.0s/40.0s

running (0m10.0s), 49/50 VUs, 2075 complete and 0 interrupted iterations
default   [  25% ] 49/50 VUs  10.0s/40.0s

running (0m11.0s), 50/50 VUs, 2568 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  11.0s/40.0s

running (0m12.0s), 50/50 VUs, 3068 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  12.0s/40.0s

running (0m13.0s), 50/50 VUs, 3168 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  13.0s/40.0s

running (0m14.0s), 50/50 VUs, 3568 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  14.0s/40.0s

running (0m15.0s), 50/50 VUs, 4040 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  15.0s/40.0s

running (0m16.0s), 50/50 VUs, 4525 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  16.0s/40.0s

running (0m17.0s), 50/50 VUs, 5018 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  17.0s/40.0s

running (0m18.0s), 50/50 VUs, 5518 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  18.0s/40.0s

running (0m19.0s), 50/50 VUs, 5968 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  19.0s/40.0s

running (0m20.0s), 50/50 VUs, 5968 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  20.0s/40.0s

running (0m21.0s), 50/50 VUs, 6468 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  21.0s/40.0s

running (0m22.0s), 50/50 VUs, 6968 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  22.0s/40.0s

running (0m23.0s), 50/50 VUs, 7468 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  23.0s/40.0s

running (0m24.0s), 50/50 VUs, 7918 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  24.0s/40.0s

running (0m25.0s), 50/50 VUs, 8418 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  25.0s/40.0s

running (0m26.0s), 50/50 VUs, 8768 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  26.0s/40.0s

running (0m27.0s), 50/50 VUs, 8999 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  27.0s/40.0s

running (0m28.0s), 50/50 VUs, 9468 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  28.0s/40.0s

running (0m29.0s), 50/50 VUs, 9968 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  29.0s/40.0s

running (0m30.0s), 50/50 VUs, 10468 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  30.0s/40.0s

running (0m31.0s), 46/50 VUs, 10904 complete and 0 interrupted iterations
default   [  77% ] 46/50 VUs  31.0s/40.0s

running (0m32.0s), 41/50 VUs, 11297 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  32.0s/40.0s

running (0m33.0s), 37/50 VUs, 11609 complete and 0 interrupted iterations
default   [  82% ] 37/50 VUs  33.0s/40.0s

running (0m34.0s), 31/50 VUs, 11646 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  34.0s/40.0s

running (0m35.0s), 26/50 VUs, 11931 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  35.0s/40.0s

running (0m36.0s), 21/50 VUs, 12166 complete and 0 interrupted iterations
default   [  90% ] 21/50 VUs  36.0s/40.0s

running (0m37.0s), 16/50 VUs, 12346 complete and 0 interrupted iterations
default   [  93% ] 16/50 VUs  37.0s/40.0s

running (0m38.0s), 11/50 VUs, 12470 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  38.0s/40.0s

running (0m39.0s), 06/50 VUs, 12555 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  39.0s/40.0s

running (0m40.0s), 03/50 VUs, 12579 complete and 0 interrupted iterations
default   [ 100% ] 03/50 VUs  40.0s/40.0s

     ✓ status 200

     checks.........................: 100.00% 12582 out of 12582
     data_received..................: 14 MB   348 kB/s
     data_sent......................: 1.1 MB  27 kB/s
     http_req_blocked...............: avg=10.44µs  min=0s       med=3µs      max=33.32ms p(90)=7µs      p(95)=11µs    
     http_req_connecting............: avg=3.95µs   min=0s       med=0s       max=29.6ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=19.2ms   min=99µs     med=1.3ms    max=1.05s   p(90)=5.33ms   p(95)=11.32ms 
       { expected_response:true }...: avg=19.2ms   min=99µs     med=1.3ms    max=1.05s   p(90)=5.33ms   p(95)=11.32ms 
     http_req_failed................: 0.00%   0 out of 12582
     http_req_receiving.............: avg=36µs     min=4µs      med=15µs     max=8.75ms  p(90)=53µs     p(95)=83µs    
     http_req_sending...............: avg=27.28µs  min=2µs      med=7µs      max=14.29ms p(90)=31µs     p(95)=70µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=19.14ms  min=88µs     med=1.25ms   max=1.05s   p(90)=5.2ms    p(95)=11.11ms 
     http_reqs......................: 12582   311.259528/s
     iteration_duration.............: avg=120.18ms min=100.14ms med=102.13ms max=1.15s   p(90)=107.16ms p(95)=114.29ms
     iterations.....................: 12582   311.259528/s
     vus............................: 3       min=3              max=50
     vus_max........................: 50      min=50             max=50


running (0m40.4s), 00/50 VUs, 12582 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s